#+TITLE: Topos Navigator Org-Babel Curriculum
#+AUTHOR: Generated via seed 1069 balanced ternary
#+DATE: 2025-10-10
#+PROPERTY: header-args :results output :exports both
#+STARTUP: showall

** Query 1: Total Interaction Count (+1)

#+begin_src sql :engine duckdb
-- Query aligned with balanced ternary [+1, ...]
SELECT
    COUNT(*) as total_interactions,
    COUNT(DISTINCT session_id) as unique_sessions,
    MIN(ts) as first_ts,
    MAX(ts) as last_ts,
    CAST((MAX(ts) - MIN(ts)) / 1000000 / 86400 AS INTEGER) as span_days
FROM read_json_auto('~/.duck/history.jsonl')
#+end_src

#+RESULTS:
: Example output:
: total_interactions | unique_sessions | first_ts | last_ts | span_days
: 1575 | 144 | 1759255861000000 | 1760083836000000 | 9

